pintapp/app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins"   ORDER BY created_at DESC
---
	def index
		@pins = Pin.all.order("created_at DESC")

INSERT INTO "pins" ("created_at", "description", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@pin = current_user.pins.build(pin_params)

		if @pin.save

SELECT  "pins".* FROM "pins"  WHERE "pins"."id" = ? LIMIT 1  [["id", 1]]
---
	def find_pin
		@pin = Pin.find(params[:id])